Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: དེ་རྣམས་ཀྱིས་བཟས་བཅད་པ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བ་རྣམས་ནི་མེའི་ཤས་ཆེ་བས་དུས་ལས་འདས་ཏེ་ཤི་འཕོས་པ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་སུ་སྐྱེས་སོ།
en: Since those who are born in the animal world have great digestive fire, they died. After they died, they were reborn among the gods attendant on the Four Great Kings.

source: །ཆོས་ཉིད་ཀྱིས་ལྷའི་བུའམ་ལྷའི་བུ་མོ་སྐྱེས་ནས་རིང་པོ་མ་ལོན་པར་སེམས་གསུམ་སྐྱེ་བར་འགྱུར་ཏེ།
en: It is natural for gods or goddesses to give rise to three thoughts just after birth:

source: །དེ་རྣམས་ཀྱིས་བལྟས་ན་དུད་འགྲོ་དག་ལས་ཤི་འཕོས་ནས་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་སུ་སྐྱེས་པ་དང་ཞེས་བྱ་བ་ནས། མེ་ཏོག་མན་དཱ་ར་བས་ཐུ་བ་བཀང་སྟེ་བཅོམ་ལྡན་འདས་ཀྱི་ཉེ་འཁོར་དང་ཆུ་བོ་གང་གཱ་སྣང་བས་གསལ་བར་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་གིས་གཏོར་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཀུན་ནས་བསྐོར་ཏེ་འདུག་གོ།
en: They observed that they had died in the animal world, that they had been born among the gods attendant on the Four Great Kings, . . . filled the front part of their garments with . . . mandārava flowers, illuminated the vicinity of the Blessed One with a display of light, scattered the flowers for the Blessed One, and sat down surrounding the Blessed One.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་དང་། ཁམས་དང་རང་བཞིན་མཁྱེན་ནས་དེ་དང་འདྲ་བའི་འཕགས་པའི་བདེན་པ་བཞི་རྟོགས་པར་འགྱུར་བའི་ཆོས་བཤད་པ་མཛད་པས་ཞེས་བྱ་བ་ནས།
en: The Blessed One knew their thinking, proclivity, disposition, and nature and preached the Dharma that was appropriate for them and that caused them to penetrate the four truths of the noble ones.

source: ཐོག་མ་མེད་པའི་དུས་ནས་བསགས་པའི་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: With the vajra of knowledge they leveled the twenty high peaks of the mountain chain of the false view of individuality that had been accumulated since beginningless time, and actualized the fruit of stream-entry.

source: དེ་རྣམས་ཀྱིས་བདེན་པ་མཐོང་བ་དང་། དེས་ལན་གསུམ་དུ་ཆེད་དུ་བརྗོད་པས་ཆེད་དུ་བརྗོད་དོ། །བཙུན་པ་འདི་ལྟ་བུ་ནི་བདག་ཅག་ལ་ཕས་མ་བགྱིས་ཏེ། མས་མ་ལགས།
en: After having seen the truths, they spoke an inspired utterance three times:

source: རང་གི་སྐྱེ་བོ་དང་། གཉེན་གྱི་ཚོགས་དང་སྡུག་པས་མ་ལགས། རྒྱལ་པོས་མ་ལགས། ལྷ་རྣམས་ཀྱིས་མ་ལགས། སྔོན་གྱི་འདས་པས་མ་ལགས། དགེ་སྦྱོང་དང་བྲམ་ཟེས་མ་ལགས་པ་གང་ལགས་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཅག་ལ་མཛད་དེ།
en: “O Honored One, what the Blessed One has done for us is what has never been done for us by our fathers, our mothers, our kinsmen and relatives, our wives, a king, gods, our ancestral spirits, śramaṇas, or brahmins.

source: སེམས་ཅན་དམྱལ་བ་དང་ཡི་དགས་རྣམས་ནས་ནི་རྐང་པ་དྲངས། ལྷ་དང་མི་རྣམས་སུ་ནི་རབ་ཏུ་བཀོད། འཁོར་བ་ལས་ནི་རིང་དུ་མཛད། ཁྲག་དང་མཆི་མའི་རྒྱ་མཚོ་ནི་བསྐམས། རུས་པའི་རི་བོ་ལས་ནི་བསྒྲལ།
en: You have pulled us out from the states of hell and hungry ghosts, placed us among the gods and humans, caused us to leave the course of rebirth far behind, dried up the ocean of blood and tears, liberated us from the mountain of bones, shut the gate to inferior states of existence, and opened the gate to heaven and liberation.

source: ངན་སོང་གི་སྒོ་རྣམས་ནི་བཀུམ། མཐོ་རིས་དང་ཐར་པའི་སྒོ་རྣམས་ནི་ཕྱེ། ཐོག་མ་མ་མཆིས་པའི་དུས་ནས་བསགས་པའི་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བགྱིས་ཏེ།
en: With the vajra of knowledge we have leveled the twenty high peaks of the mountain chain of the false view of individuality that had been accumulated since beginningless time, and actualized the fruit of stream-entry.

source: །བདག་ཅག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆི་ལགས་ཀྱིས། བདག་ཅག་དགེ་བསྙེན་དུ་གཟུང་དུ་གསོལ།
en: Since we seek refuge in the Blessed One, the Dharma, and the community of monks, please accept us as lay brothers.

source: །དེ་ནས་སྔོན་ཉ་དང་། ངང་པ་དང་། རུ་སྦལ་བྱེད་བྱེད་པའི་ལྷའི་བུ་དེ་རྣམས་ཚོང་པ་ཁེ་སྤོགས་རྙེད་པ་ལྟ་བུ་དང་ཞེས་བྱ་བ་ནས་རང་གི་གནས་སུ་དོང་ངོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Thereupon the gods who had once been the fish, haṃsas, and turtles, like a merchant who had obtained merchandise, . . . went to their houses. B. The Former Lives of the Haṃsas, Fish, and Turtles

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་ཉ་དང་། ངང་པ་དང་། རུ་སྦལ་འདི་རྣམས་ཀྱིས་ལས་ཅི་ཞིག་བགྱིས་ན་དེས་ན་ངང་པ་དང་། ཉ་དང་། རུ་སྦལ་རྣམས་སུ་སྐྱེས་ལགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “O Honored One, what karma did the fish, haṃsas, and turtles create that matured to cause them to be born among haṃsas, fish, and turtles?

source: ལས་ཅི་ཞིག་བགྱིས་ན་དེས་ན་ལྷ་རྣམས་སུ་སྐྱེས་ནས་བདེན་པ་མཐོང་བར་བགྱིས་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: What karma did they create that matured to cause them to be born among gods and to see the truths?”

source: དགེ་སློང་དག་ངང་པ་དང་། ཉ་དང་། རུ་སྦལ་འདི་དག་ཉིད་ཀྱིས་ལས་རྣམས་བྱས་ཤིང་བསགས་པ་ཚོགས་རྙེད་པ་དག་ནི་ཞེས་བྱ་བ་ནས།
en: “Monks,” the Blessed One replied, “the actions were performed and accumulated by these sons of gods who had once been haṃsas, fish, and turtles themselves, accruing a heap of karma. . . . “. . .

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་སྟོན་པ་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ་ཞེས་བྱ་བ་ནས།
en: “Monks, once, in this fortunate eon, when people’s lifespans were twenty thousand years long, there appeared in the world a teacher named Kāśyapa, . . . .

source: དེ་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་ན་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་ན་ཉེ་བར་རྟེན་ཅིང་བཞུགས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: He stayed in Ṛṣivadana Deer Park near the city of Vārāṇasī.

source: །དེའི་བསྟན་པ་ལ་དེ་རྣམས་རབ་ཏུ་བྱུང་བར་གྱུར་ཏེ།
en: In his teaching these gods went forth.

source: དེ་ན་དགེ་སློང་དེ་རྣམས་ཀྱིས་བསླབ་པའི་གཞི་ཕྲ་མོ་ཕྲ་མོ་རྣམས་དྲལ་བས་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཉ་དང་། ངང་པ་དང་། རུ་སྦལ་རྣམས་སུ་སྐྱེས་པར་གྱུར་ཏོ།
en: There these monks transgressed the minor rules of training; that karma matured to cause them to be reborn among fish, haṃsas, and turtles.

source: །གང་ཡང་ང་ལ་སེམས་མངོན་པར་དད་པར་བྱས་པ་དེས་ན་ལྷ་རྣམས་སུ་སྐྱེས་པར་གྱུར་ཏོ།
en: Because they had gained faith in me, they were reborn among the gods.

source: །གང་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལས་ཚངས་པར་སྤྱོད་པ་སྤྱད་པ་དེས་ན་བདེན་པ་མཐོང་བར་བྱས་སོ།
en: Because they led the pure life in the presence of the Perfectly Awakened One Kāśyapa, they saw the truths.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན། གཅིག་ཏུ་གནག་པའི་ལས་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པ་ཡིན་ལ་ཞེས་བྱ་བ་ནས་བརྩལ་བར་བྱ་སྟེ།
en: Therefore, monks, the maturation of entirely negative actions is entirely negative . . . you should seek . . . .

source: དགེ་སློང་དག་ཁྱེད་ཅག་གིས་དེ་ལྟ་བུ་ལ་བསླབ་པར་བྱའོ། །ཞེས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Monks, that is how you must train.” VIII.

source: །ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Hungry Ghosts A.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཆུ་བོ་གང་གཱ་རྒལ་བ་དང་ཡི་དགས་སྡོང་དུམ་ཚིག་པ་ལྟ་བུ།
en: The Conversation with the Five Hundred Hungry Ghosts

source: ཀེང་རུས་སྒྲེང་བ་ལྟ་བུ། རང་གི་སྐྲས་ལུས་ཡོག་པ། ལྟོ་རི་སུལ་ལྟར་འདུག་པ། ཁ་ཁབ་ཀྱི་མིག་ཙམ་ཡོད་པ་འབར་རབ་ཏུ་འབར། ཀུན་དུ་རབ་ཏུ་འབར་ཏེ་མེ་ལྕེ་གཅིག་ཏུ་གྱུར་པ་ལྔ་བརྒྱ་ཙམ་གྱིས་ཡོངས་སུ་བསྐོར་ནས།
en: After the Blessed One had crossed the Ganges, he was surrounded by five hundred hungry ghosts who were just like burnt logs or raised skeletons, covered with hair, whose bellies were just like mountains, whose mouths were just like pinholes, who were burning, thoroughly burning, thoroughly and entirely burning, blazing as a single flame.

source: དེ་རྣམས་ཀྱིས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བདག་ཅག་ཡི་དགས་རྣམས་ནི་རྣམ་པར་ལྟུང་བའི་ལུས་ཅན་རྣམས་ལགས་ཏེ། སྔོན་གྱི་ལས་ཀྱི་ནོངས་པས་ཆབ་ཀྱང་མི་རྙེད་ལགས་ན་འཚལ་མ་མཐོང་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: They made the gesture of supplication and said to the Blessed One, “O Honored One, we hungry ghosts have inferior bodies and are unable to obtain even water because of our sinful past actions, not to mention food.

source: ཁྱོད་ནི་ཐུགས་རྗེ་ཆེན་པོ་མངའ་བ་ལགས་ན་བདག་ཅག་ལ་ཆབ་སྩོལ་ཅིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ལ་ཆུ་བོ་གང་གཱ་བསྟན་ནས།
en: You are of great compassion; please give us water.” The Blessed One indicated the Ganges to them:

source: ཆུ་བསིལ་སྐྱེ་བོ་ཀུན་གྱིས་ཉེ་བར་སྤྱད་བྱ་བ།
en: “This cool water to be enjoyed by all people,

source: །སྐལ་ལྡན་ཤིང་རྟ་ཀླུང་ཆེན་འདི་ནི་གྲོང་དག་དང་། །ཡུལ་འཁོར་དག་དང་གྲོང་ཁྱེར་ཚིམ་པར་བྱེད་ཅིང་འབབ།
en: This great river Bhāgīrathī, flows, Satisfying villages, provinces, and cities.

source: །ཞིང་རྣང་སཱ་ལུ་ཀུ་མུ་ད་དང་ཨུཏྤལ་སྐྲུན།
en: It produces rice of the field, kumuda, and utpala.”

source: །ཡི་དགས་རྣམས་ཀྱིས་གསོལ་པ།
en: The hungry ghosts said:

source: ཆུ་བོ་སྐྱེ་བོ་ཀུན་གྱིས་ཉེ་བར་སྤྱད་བགྱི་བ།
en: “This river to be enjoyed by all people,

source: །སྐལ་ལྡན་ཤིང་རྟ་འབབ་འདི་བདག་ཅག་རྣམས་ལ་སྐམས།
en: The Bhāgīrathī, does flow, but this is dry for us.

source: །འདི་ནི་ཁྲག་གི་དྲི་མས་གང་ཞིང་ལག་པ་ན།
en: We see this full of the impurity of blood

source: །དབྱུག་པ་དགྲ་སྟར་བཅས་པ་ཐོགས་པས་འདི་བསྲུངས་མཐོང་།
en: And guarded by ones holding in their hands sticks and axes.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་གང་གཱའི་ལྷ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One said to the deity of the Ganges:

source: ཁྱོད་ནི་གྲོང་དང་ཡུལ་འཁོར་གྲོང་ཁྱེར་ཚིམ་བྱེད་ཅིང་།
en: “Satisfying villages, provinces, and cities,

source: །ཅི་ཕྱིར་ཡི་དགས་སྐོམ་པས་རབ་ཉེན་ཚིམ་མི་བྱེད།
en: Why do you not satisfy the hungry ghosts who suffer from thirst?

source: །ཁྱོད་ལ་བྱིས་པའི་སྐྱེ་བོ་སྡུག་བསྔལ་སྙིང་རྗེ་མེད།
en: You lack mercy for these foolish creatures.”

source: །གང་གཱའི་ལྷས་གསོལ་པ།
en: The deity of the Ganges said:

source: བྱིས་པའི་སྐྱེ་བོ་ལ་བདག་འཇིགས་པས་མ་ལགས་ཤིང་།
en: “To foolish creatures I give water unequally neither because of fear,

source: །ཚིག་རྩུབ་སྒྱུས་ཀྱང་མི་མཐུན་ཆབ་གཏོང་མི་བགྱིད་དེ།
en: Nor because of their harsh words, nor because of their deceitfulness.

source: །ནོངས་བགྱིས་སྒྲིབ་པ་ཆེན་པོས་བསྒྲིབས་པ་འདི་དག་ལ།
en: But for these ones, who have committed evil actions and are veiled by great obscurations,

source: །ཆུ་བོ་སྐམས་གྱུར་འདི་ལ་བདག་གིས་ཅི་ཞིག་ནོངས།
en: The river is dry; how is any of this my fault?”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ།
en: Thereupon the Blessed One instructed the venerable Mahā­maudgalyāyana, “Maudgalyāyana, pour water on the hungry ghosts.”

source: མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཡི་དགས་རྣམས་ལ་ཆུ་ལུད་ཅིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས་ཡི་དགས་རྣམས་ལ་ཆུ་བླུད་པར་བརྩམས་པ་དང་། ཡི་དགས་དེ་རྣམས་ཀྱི་ཁ་ཁབ་ཀྱི་མིག་ཙམ་པོ་དག་བསྐྱེད་པར་མ་ནུས་སོ།
en: “Certainly, O Honored One,” replied the venerable Mahā­maudgalyāyana, and he started to pour water on the hungry ghosts, but he was unable to expand the hungry ghosts’ mouths, which were as small as pinholes. The Blessed One then expanded their mouths using his magical power, and the venerable Mahā­maudgalyāyana poured water in.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱིས་དེ་རྣམས་ཀྱི་ཁ་བསྐྱེད་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་ཆུ་བླུད་པ་དང་། དེ་རྣམས་སྐོམ་པས་ཉེན་པས་མང་དུ་འཐུངས་པས་ལྟོ་རྒྱས་པར་གྱུར་ཏོ།
en: Suffering from thirst, they drank so much that their bellies swelled.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་སེམས་དང་བ་བསྐྱེད་ནས་ཤིའོ་ཞེས་བྱ་བ་ནས། བདེན་པ་མཐོང་ནས་རང་གི་གནས་སུ་སོང་ངོ་།
en: Then they died, having harbored such pure minds for the Blessed One . . . after having seen the truths, they left for their own residences. B.

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་ཡི་དགས་འདི་རྣམས་ཀྱིས་ལས་ཅི་ཞིག་བགྱིས་ན་དེས་ན་ཡི་དགས་རྣམས་སུ་སྐྱེས་ལགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “O Honored One, what karma did these hungry ghosts create that matured to cause them to be born among hungry ghosts?

source: ལས་ཅི་ཞིག་བགྱིས་ན་དེས་ན་ལྷ་རྣམས་སུ་སྐྱེས་ནས་བདེན་པ་མཐོང་བར་བགྱིས་ལགས།
en: What karma did they create that matured to cause them to be born among gods and see the truths?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་དག་ཉིད་ཀྱིས་ལས་རྣམས་བྱས་ཤིང་བསགས་པ་ཚོགས་རྙེད་པ་དག་ནི་ཞེས་བྱ་བ་ནས།
en: The Blessed One said, “Monks, the actions were performed and accumulated by themselves, accruing a heap of karma. . . . . “. . .

source: ལུས་ཅན་དག་ལ་འབྲས་བུར་འགྱུར།
en: They bear fruit in embodied beings.

source: ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དགེ་སློང་དག་སྔོན་བྱུང་བ་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་སྟོན་པ་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Monks, once, in this fortunate eon, when people’s lifespans were twenty thousand years long, there appeared in the world a teacher named Kāśyapa . . . .

source: ཞེས་བྱ་བ་ནས། དེ་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་ན་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་ན་ཉེ་བར་རྟེན་ཅིང་བཞུགས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: He stayed in the Ṛṣivadana Deer Park near the city of Vārāṇasī.

source: །དེའི་ཉན་ཐོས་རྣམས་ཀྱིས་དད་པ་ལས་བསླངས་ནས་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་བྱ་བ་བྱེད་དོ།
en: “His disciples used to beg for alms out of faith and served the Buddha, Dharma, and Saṅgha.

source: །གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་གི་བསྟན་པ་རྒྱས་པར་མ་གྱུར་པ་དེའི་ཚེ་དད་པ་འདྲི་བའི་དགེ་སློང་ཡང་ཉུང་བར་གྱུར་ཏོ།
en: When the Perfectly Awakened One Kāśyapa’s teaching was not extensive, there were few monks who asked for alms out of faith. When it became extensive, there were many such monks.

source: །གང་གི་ཚེ་རྒྱས་པར་གྱུར་པ་དེའི་ཚེ་དད་པ་འདྲི་བའི་དགེ་སློང་ཡང་མང་བར་གྱུར་ཏོ། །ཇི་ཙམ་ན་འདུན་ཁང་ཞིག་ན་དགེ་བསྙེན་ལྔ་བརྒྱ་བྱ་བ་འགའ་ཞིག་གི་ཕྱིར་ལྷགས་ཤིང་འདུས་པར་གྱུར་པ་དང་། དད་པ་འདྲི་བའི་དགེ་སློང་རབ་ཏུ་མང་པོ་དག་དེ་རྣམས་ཀྱི་དྲུང་དུ་སོང་ནས་སྦྱིན་དུ་གཞུག་པར་འདོད་པ་ན།
en: At that time, when five hundred lay brothers were meeting together in an assembly hall for some business, many monks asking for alms out of faith went to them, wishing to receive alms.

source: དེ་རྣམས་ཀྱིས་ཀུན་ནས་དཀྲིས་པ་དྲག་པོས་ངག་རྩུབ་པའི་ལས་ཕྱུང་བ།
en: The lay brothers, in fierce anger, created the karma of harsh speech:

source: འོད་སྲུང་གི་དགེ་སྦྱོང་འདི་རྣམས་ནི་ཡི་དགས་རྣམས་སུ་སྐྱེས་པ་བཞིན་རྟག་ཏུ་ལག་པ་ཟེད་པར་བྱེད་དོ་ཞེས་སྨྲས་སོ།
en: ‘These śramaṇas of Kāśyapa always hold out their hands as if they have been born as hungry ghosts.’

source: དགེ་བསྙེན་ལྔ་བརྒྱ་པོ་གང་དག་ཡིན་པ་དེ་དག་ནི་ཡི་དགས་ལྔ་བརྒྱ་པོ་འདི་དག་ཉིད་ཡིན་ཏེ།
en: Those five hundred lay brothers were indeed these five hundred hungry ghosts.

source: གང་ཡང་འདི་རྣམས་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཉན་ཐོས་རྣམས་ལ་ཡི་དགས་ཀྱི་ཚིག་སྨྲས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཚེ་རབས་ལྔ་བརྒྱར་ཡི་དགས་རྣམས་སུ་སྐྱེས་པར་གྱུར་ཏེ། ད་ལྟའི་བར་དུ་ཡང་ཡི་དགས་རྣམས་སུ་སྐྱེས་པ་ཡིན་ནོ།
en: Because of the maturation of the karma—namely, their saying the words ‘hungry ghosts’ to the disciples of the Perfectly Awakened One Kāśyapa—they were born among hungry ghosts for five hundred lives, and now they were also born among hungry ghosts.

source: །གང་ཡང་ང་ལ་སེམས་མངོན་པར་དད་པར་བྱས་པ་དེས་ན་ལྷ་རྣམས་སུ་སྐྱེས་སོ།
en: Because they had gained faith in me, they were reborn among the gods.

source: །གང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་བླངས་པ་དེས་ན་བདེན་པ་མཐོང་བར་བྱས་སོ།
en: Because they sought refuge in the Perfectly Awakened One Kāśyapa and accepted the rules of training, they saw the truths.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན་གཅིག་ཏུ་གནག་པ་རྣམས་ཀྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པ་ཡིན་ལ་ཞེས་བྱ་བ་ནས་བརྩལ་བར་བྱ་སྟེ།
en: “Therefore, monks, the maturation of entirely negative actions is entirely negative . . . you should seek . . . .

source: དགེ་སློང་དག་ཁྱེད་ཅག་གིས་དེ་ལྟ་བུ་ལ་བསླབ་པར་བྱའོ།
en: Monks, that is how you must train.” Thus spoke the Blessed One. IX. Velāma

source: །ཞེས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཆུ་བོ་གང་གཱ་ལས་རྒལ་བ་ན་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཀྱིས་གཡས་ཕྱོགས་ནས་ཆུ་བོ་གང་གཱ་ལ་གཟིགས་པ་དང་། དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: After the Blessed One had crossed the Ganges, he looked back at the river, turning to the right just as an elephant does.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་གཡས་ཕྱོགས་ནས་ཆུ་བོ་གང་གཱ་ལ་གཟིགས་པར་མཛད།
en: The monks asked the Blessed One, “O Honored One, on account of what did the Blessed One look back at the Ganges, turning to the right?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཁྱེད་ཅག་ཆུ་བོ་གང་གཱའི་གླེང་གཞི་ཉན་པར་འདོད་དམ།
en: “Monks,” the Blessed One replied, “do you want to hear the origin of the Ganges?”

source: བཅོམ་ལྡན་འདས་ད་དེའི་དུས་ལ་བབ་ལགས་སོ།
en: “O Honored One, now it is the right time.

source: །བདེ་བར་གཤེགས་པ་ད་དེའི་དུས་ལ་བབ་ལགས་ཏེ།
en: O Sugata, now it is the right time.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆུ་བོ་གང་གཱའི་གླེང་གཞི་གང་ལགས་པ་བཤད་ན་དགེ་སློང་རྣམས་ཉན་པར་འགྱུར་ལགས་སོ།། །།འདུལ་བ་གཞི། བམ་པོ་སུམ་བཅུ་རྩ་དགུ་པ།
en: If the Blessed One explains the origin of the Ganges, the monks will listen to it.”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་རྒྱལ་པོ་སྨྱུག་སྦམས་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ།
en: “Monks, once there appeared a righteous Dharma king named Piṇḍavaṃśa.

source: དེའི་ཡུལ་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ། ཤིང་མེ་ཏོག་དང་འབྲས་བུ་རྟག་པ། ལྷ་རྣམས་དུས་དུས་སུ་ཆར་འབེབས་པས་ས་གཞི་ལོ་ཐོག་དང་ལྡན་ཞིང་འཐབ་པ་དང་། ཐབ་མོ་དང་། རྩོད་པ་དང་། འཁྲུག་ལོང་དང་། ཆོམ་རྐུན་དང་། མུ་གེ་དང་། ནད་རྣམས་རབ་ཏུ་ཞི་བར་གྱུར་ལ། མི་རྣམས་རྟག་ཏུ་ཆོས་ལ་གཞོལ་བ་ན་ཆོས་ཀྱིས་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་གོ།
en: In accordance with the Dharma, he ruled over the country, which was rich, prosperous, peaceful, abundant in food, and full of many people, where trees were always full of blossoms and fruits, and the gods brought rain at the appropriate times so that the fields produced rich crops. There was no fighting, combat, dispute, strife, robbers, famine, or illness there, and the people were always absorbed in the Dharma.

source: །ཇི་ཙམ་ན་རྒྱལ་པོ་དེ་སོ་གའི་དུས་ལ་བབ་ནས་ཤིང་རྣམས་ཀྱི་མེ་ཏོག་ཁ་འབུས་ཤིང་ངང་པ་དང་། ཁྲུང་ཁྲུང་དང་། རྨ་བྱ་དང་། ནེ་ཙོ་དང་། རི་སྐེགས་དང་། ཁུ་བྱུག་དང་། ཤང་ཤང་ཏེའུ་རྣམས་སྐད་འབྱིན་པའི་ནགས་ཁྲོད་དུ་བཙུན་མོའི་འཁོར་གྱིས་ཡོངས་སུ་བསྐོར་ནས་སྐྱེད་མོས་ཚལ་གྱི་གནས་སུ་སོང་བ་དང་། ཇི་ཙམ་ན་མི་ལུས་གཉེར་མས་གང་བ།
en: “When spring came, the king, surrounded by his consorts, went to a park in a forest where the trees were budding and birds such as haṃsas, cranes, peacocks, parrots, hill mynas, cuckoos, and jīvaṃjīvakas were singing. “At that time, he saw a man hobbling about on a cane, taking slow steps.

source: མགོ་སྐྱ་བ། ལུས་ཀྱི་ཡན་ལག་རྙིས་པ། དབང་པོ་རྒུད་པ། ཤ་སྐེམ་པ། ཞོ་ཤ་ཆུང་བ་ཞིག་ཁར་བ་ལ་བརྟེན་ནས་གོམ་པ་དལ་བུ་དལ་བུས་འགྲོ་བ་ཞིག་མཐོང་ངོ་།
en: His body was full of wrinkles, his head was gray, his limbs were weak, his faculties were frail, his flesh was wizened, and his energy was feeble.

source: །དེ་ནས་རྒྱལ་པོས་བློན་པོ་རྣམས་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་མི་ལུས་གཉེར་མས་གང་བ་མགོ་སྐྱ་བ་ཞེས་བྱ་བ་ནས། ཁར་བ་ལ་བརྟེན་ནས་འགྲོ་བ་འདི་ཅི་ཞིག་ཡིན་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: The king asked his ministers, ‘Sirs, what is this man hobbling about on a cane, whose body is full of wrinkles, whose head is gray . . . ?’

source: ལྷ་དེ་ནི་འདུ་བྱེད་རྣམས་དེངས་པས་རྒས་འཁོགས་པ་ཞེས་བགྱིའོ། །རྒྱལ་པོས་སྨྲས་པ།
en: “ ‘Your Majesty,” they answered, “he is said to be an old, aged man because of the loss of his conditioning factors.’

source: ཤེས་ལྡན་དག་ང་ལ་ཡང་འདི་ལྟ་བུའི་ཆོས་འབྱུང་བར་འགྱུར་རམ།
en: “ ‘Sirs, will such a thing happen to me, too?’ asked the king.

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་ཆོས་དེ་ནི་ཐུན་མོང་ལགས་སོ།
en: “ ‘Your Majesty, this is common to everyone,’ the ministers answered.

source: །དེ་ནས་རྒྱལ་པོ་ཡིད་མི་བདེ་ཞིང་ཆས་པ་དང་ཡང་མི་སྐྱ་བོ་རྦབ་རྦབ་བོ།
en: “The king departed, feeling melancholy.

source: ལུས་གས་ཤིང་ཧྲུད་ཧྲུད་པོ། ལྟོ་རི་སུལ་ལྟར་འདུག་པ།
en: Then he saw a pale man with his body in bandages, limping about on a cane with much sighing.

source: རྨ་རྣག་གིས་གང་བ། ཡན་ལག་དང་ཉིང་ལག་རྣམས་ལས་འཛག་པ། ལྷན་པ་རྣམས་ཀྱིས་དཀྲིས་པ་ཞིག་ཤུགས་རིང་པོ་རིང་པོར་འབྱིན་ཅིང་ཁར་བ་ལ་བརྟེན་ནས་འཐེང་ཞིང་འགྲོ་བར་ཆས་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བློན་པོ་རྣམས་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་མི་སྐྱ་བོ་བསེང་བསེང་པོ་ཞེས་བྱ་བ་ནས། འཐེང་ཞིང་འགྲོ་བར་ཆས་པ་འདི་ཅི་ཞིག་ཡིན་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: His body was covered with cuts and sores, his belly was concave like a valley, and his major limbs and minor appendages were covered with wounds that oozed pus. Having seen him, the king again asked his ministers, ‘Sirs, what is this pale man limping about on a cane . . .?’

source: །དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་འདི་ནི་ནད་ཀྱིས་ཐེབས་པ་ཞེས་བགྱིའོ། །རྒྱལ་པོས་སྨྲས་པ།
en: “ ‘Your Majesty,’ they answered, “he is called one afflicted with illness.’

source: བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་ཆོས་འདི་ནི་ཐུན་མོང་ལགས་ཏེ།
en: “ ‘Your Majesty,’ the ministers answered, ‘this is common to everyone.

source: ཉེས་པར་སྤྱོད་པའི་ལས་བགྱིས་པ་རྣམས་ལ་སྔོན་གྱི་ལས་ཀྱི་ཉེས་པས་འབྱུང་བར་འགྱུར་རོ།
en: As a result of faults that they committed in the past, this happens to people who have performed sinful acts.’

source: །རྒྱལ་པོས་བསམས་པ། རྣམ་པ་ཐམས་ཅད་དུ་སྡིག་པ་མི་བྱའོ་སྙམ་དུ་བསམས་ནས་ཆས་པ་དང་། ཡང་དེས་རས་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་རྣམས་ཀྱིས་ཁྱོགས་བརྒྱན་ནས་གདུགས་དང་། རྒྱལ་མཚན་དང་། འཕན་དང་། དུང་དང་། རྔ་ཕ་ཊ་ཧ་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དག་བུན་ལོང་ཞིང་།
en: “The king departed, thinking, ‘One should not perform evil acts by any means.’ Then he saw a bier decorated with blue, yellow, red, and white cloth, surrounded by parasols, banners, flags, conch shells, paṭaha drums, men, women, boys, and girls.

source: མི་བཞིས་བཏེག་ནས་མགྱོགས་མིས་ནི་སྣ་དྲངས། སྐྱེས་བུ་ལག་ན་ཤིང་ཐོགས་པ་ནི་ཕྱི་བཞིན་འབྲང་ཞིང་ཀྱི་ཧུད་ཕ།
en: It was shouldered by four men, preceded by a person carrying a fire, followed by a man carrying firewood, and people crying everywhere, ‘Alas! Father!’ ‘Alas!

source: ཀྱི་ཧུད་སྡུག་པ།
en: Son!’ ‘Alas!

source: ཀྱི་ཧུད་སྤུན།
en: Brother!’ ‘Alas!

source: ཀྱི་ཧུད་ཇོ་བོ་ཞེས་ཀུན་དུ་ངུད་མོའི་སྒྲ་འདོན་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བློན་པོ་རྣམས་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་རས་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་རྣམས་ཀྱིས་ཁྱོགས་བརྒྱན་ཅིང་ཞེས་བྱ་བ་ནས། ངུད་མོའི་སྒྲ་འདོན་པ་འདི་ཅི་ཞིག་ཡིན་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Husband!’ When he saw this, he again asked his ministers, ‘Sirs, what is this bier decorated with blue, yellow, red, and white cloth . . . and people crying?’

source: །བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་འདི་ནི་གུམ་པ་ཞེས་བགྱིའོ། །རྒྱལ་པོས་སྨྲས་པ།
en: “ ‘Your Majesty,’ the ministers answered, ‘this is called a dead man.’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་ཆོས་འདི་ནི་ཐུན་མོང་ལགས་སོ།
en: “ ‘Your Majesty, this is common to everyone,’ they answered.

source: །དེ་ནས་རྒྱལ་པོས་རྒས་པ་དང་། ནད་པ་དང་། ཤི་བ་ཡང་དག་པར་མཐོང་ནས་ཡིད་བྱུང་སྟེ།
en: “Having seen the old man, the sick man, and the dead man, the king felt melancholy.

source: བདག་གིས་ཀྱང་འདི་ལྟ་བུའི་ལོངས་སྤྱོད་རྣམས་སྤང་དགོས་སོ་སྙམ་ནས་སླར་ལོག་སྟེ། མྱ་ངན་གྱི་ཁང་པར་ཞུགས་ནས་འདུག་གོ།
en: He went home and stayed in the lamentation room, thinking, ‘I will no longer be able to take pleasure in my present enjoyments.’

source: །དེའི་ཡུལ་ན་བྲམ་ཟེ་དུས་དཔོག་ཅེས་བྱ་བ་ཕྱུག་པ་ནོར་མང་བ་ལོངས་སྤྱོད་ཆེ་བ་ཞིག་ཡོད་དེ།
en: “In his land, there was a brahmin named Velāma, who was rich and had great wealth and many possessions.

source: དེས་ཇི་ལྟར་རྒྱལ་པོས་རྒས་པ་དང་། ནད་པ་དང་། ཤི་བ་མཐོང་སྟེ་ཡིད་བྱུང་ནས་མྱ་ངན་གྱི་ཁང་པར་ཞུགས་ནས་འདུག་པ་ཐོས་སོ།
en: He heard that the king felt melancholy and was staying in the lamentation room, having seen an old man, a sick man, and a dead man.

source: །ཐོས་ནས་ཀྱང་བྲམ་ཟེ་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་ཤིང་རྟ་རྟ་རྒོད་མ་དང་ལྡན་པ་ཐམས་ཅད་ནས་དཀར་བའི་ནང་དུ་ཞུགས་ཏེ། གསེར་གྱི་ཁར་བ་དང་རིལ་བ་སྤྱི་བླུགས་ཐོགས་ནས་རྒྱལ་པོ་སྨྱུག་སྦམས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། རྒྱལ་པོ་ལ་བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་བྲམ་ཟེ་དུས་དཔོག་ཆབ་སྒོ་ན་མཆིས་སོ།
en: Upon hearing this, he went to King Piṇḍavaṃśa, riding an entirely white chariot pulled by mares, carrying a golden water jar with a handle, and surrounded by hundreds of thousands of brahmins. When he arrived, the ministers said to the king, ‘Your Majesty, Brahmin Velāma is standing at the door.’
